Revit 2026 API

# ScheduleDefinitionClearFilters Method

---

Removes all filters.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ClearFilters()
```
```vb
Public Sub ClearFilters
```
```cpp
public:
void ClearFilters()
```
```fsharp
member ClearFilters : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This ScheduleDefinition does not support filters. |

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace